<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e6bdfcb7e72cadf953d7b32a922eecdc8971ae5268758565f16b83ed8a9e37a1","plan_job_ref":"Job Terraform checks on pull request #29 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/11251372858","plan_out_hash":"50a265f48e5e73037705f41098164a27a8418afe3ae8b2a7de50f852ef164d7a","plan_hash":"e35acf78cf886cd1db3a5bafebb3fa97884cf697f2654410ada2bb5b14bc2d05","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.terraform.modularised-demo"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.modularised-demo"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.modularised-demo"
        name                        = "sudoblark.terraform.modularised-demo"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_files"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.s3_files"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_files"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.s3_files"
        name                        = "sudoblark.terraform.module.aws.s3_files"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_files"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
          - Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
          - Unauthorized copying of this file, via any medium is strictly prohibited
          - Proprietary and confidential
          - Written by Benjamin Clark <bclark@sudoblark.com>, 2024
          + Copyright (c) 2024, Sudoblark Ltd
          + All rights reserved.
          + 
          + Redistribution and use in source and binary forms, with or without
          + modification, are permitted provided that the following conditions are met:
          + 
          + * Redistributions of source code must retain the above copyright notice, this
          +   list of conditions and the following disclaimer.
          + 
          + * Redistributions in binary form must reproduce the above copyright notice,
          +   this list of conditions and the following disclaimer in the documentation
          +   and/or other materials provided with the distribution.
          + 
          + * Neither the name of the copyright holder nor the names of its
          +   contributors may be used to endorse or promote products derived from
          +   this software without specific prior written permission.
          + 
          + THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
          + AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
          + IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
          + DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
          + FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
          + DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
          + SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
          + CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
          + OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
          + OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
        id                  = "sudoblark.terraform.module.aws.s3_files/LICENSE.txt"
#        (9 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #29](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/11251372858)